---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BuildingPadNoSurface
source: html/1b4edf8f-bddc-1a2b-f093-af6c2a966cdb.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BuildingPadNoSurface Property

A Pad can't extend beyond the edge of a Toposurface.

## Syntax (C#)
```csharp
public static FailureDefinitionId BuildingPadNoSurface { get; }
```